[
  {
    "id": 1,
    "name": "LISEN Retractable Car Charger ",
    "price": 16,
    "image": "/product/e1.jpeg",
    "images": ["/product/e1.1.jpeg", "/product/e1.2.jpeg"],
    "keyFeature1": "Compact Yet Powerful Design: The LISEN 4 in 1 Retractable Car Charger is a sleek and space-saving solution, measuring approximately 5.9 x 2.64 x 1.38 inches.",
    "keyFeature2": "Retractable Cord for Convenience: This charger features a retractable cord design that extends up to 2.6 feet (31.5 inches) when in use and retracts to leave only 0.51 inches of the charging head exposed, keeping your car's interior neat and organized.",
    "keyFeature3": "69W 4-Port Fast Charging: With a 30W USB-C PD port, a 12W USB Lightning cable, a 15W USB-C port, and a 12W USB-A port, this powerful car charger allows you to charge up to four devices simultaneously at optimal speeds, including the iPhone 16 Pro Max.",
    "category": "Electronics"
  },
  {
    "id": 2,
    "name": "Samsung Galaxy Tab A9+ Tablet 11 64GB",
    "price": 136.13,
    "image": "/product/e2.jpeg",
    "images": ["/product/e2.3.jpeg", "/product/e2.1.jpeg"],
    "keyFeature1": "BIG SCREEN. FAMILY-SIZED FUN: Bring fun home to everyone with a bright, engaging screen; great for videos, games or fun time for the kids (11” 1920 x 1200, 90Hz, 480 nits, TFT LCD)",
    "keyFeature2": "RICH SOUND ALL AROUND: Your music; Your shows; Your games; Hear them all loud and clear, thanks to quad speakers powered by Dolby Atmos; Galaxy Tab A9+ delivers a cinema-like audio experience your ears will love",
    "keyFeature3": "POWER FOR ALL YOU DO. STORAGE FOR ALL YOU LOVE: Watch videos, play games and do more with an upgraded chipset; 4GB RAM + 64GB | 8GB RAM + 128GB | Up to 1TB expandable storage; Processor Qualcomm Snapdragon 69",
    "category": "Electronics"
  },
  {
    "id": 3,
    "name": "Wireless Charger iPhone Charging Station",
    "price": 22.27,
    "image": "/product/e3.jpeg",
    "images": ["/product/e3.1.jpeg", "/product/e3.2.jpeg"],
    "keyFeature1": "Versatile Multi-Device Charging Station: This 3-in-1 wireless charger effortlessly powers up your iPhone (16, 15, 14, 13, 12, 11, Pro, Max, Mini, Plus, X, XR, XS, SE), Apple Watch (Series 10, 9, 8, 7, 6, 5, 4, 3, 2, SE, Ultra), and AirPods (4, 3, 2, Pro, Pro 2 with MagSafe case), making it an ideal accessory for personal or professional use.",
    "keyFeature2": "Fast and Efficient Charging: Equipped with 7.5W for phones, 3W for earbuds, and 2.5W for watches, this charger ensures your devices are powered up quickly and reliably, whether at home, the office, or on the go.",
    "keyFeature3": "Portable and Sleek Design: With its foldable and lightweight construction, this charging station is easily transportable, fitting seamlessly into bags for convenient charging while traveling or working remotely. Its streamlined aesthetic enhances any room or office space.",
    "category": "Electronics"
  },
  {
    "id": 4,
    "name": "Projector with WiFi and Bluetooth",
    "price": 79.99,
    "image": "/product/e4.jpeg",
    "images": ["/product/e4.1.jpeg", "/product/e4.2.jpeg"],
    "keyFeature1": "[Convenient WiFi Connection] Connecting deivces with our wifi projector through wifi. We have TWO things to make it friendly user: (1) Updated the wifi connection steps, make it easier and more stable; (2) Updated the wifi connection speed, you can connect the wifi more quickly. So own our wifi projector, you can enjoy it anytime anywhere, it makes your life easier and happier.",
    "keyFeature2": "[Three Added Bonus Better than others] (1) Higher Brightness: Our upgraded brightness is higher than others. It is much brighter than most mini projectors. (2) Better Native Resolution: our wifi mini projector's native resolution is 1280 x 720P, with 1920x1080P supported, better than 90% mini projectors which are native 480P. (3) Add Bluetooth: It is a mini projector with wifi and bluetooth, you can hook up external speakers via bluetooth, the sound is greatly enhanced and sounded theater quality.",
    "keyFeature3": "[Meet Your Home Needs] Watch movies, take online classes, or keep the kids entertained with hours of cartoons and educational videos [ideal for use in low-light environments]. It's the innovation of traditional projector, built-in stereo speakers, adjust keystone and focus to get 32’’ 176’’ projection size with 1.5m-5m projection distance, bring excellent spectating experience. Perfect projector for outdoor movies and movie projector for indoor use.",
    "category": "Electronics"
  },
  {
    "id": 5,
    "name": "JBL CHARGE 5",
    "price": 139.95,
    "image": "/product/e5.jpeg",
    "images": ["/product/e5.1.jpeg", "/product/e5.2.jpeg"],
    "keyFeature1": "Powerful Audio Performance: The JBL Charge 5 delivers bold JBL Original Pro Sound with an optimized long excursion driver, separate tweeter, and dual bass radiators, providing rich and clear audio even outdoors.",
    "keyFeature2": "Rugged Portability: With an IP67 waterproof and dustproof rating, 20-hour battery life, and a built-in power bank to charge devices, this portable Bluetooth speaker is designed for all-day adventures.",
    "keyFeature3": "PartyBoost Connectivity: Link multiple JBL PartyBoost-compatible speakers together wirelessly for amplified stereo sound and truly pump up your party.",
    "category": "Electronics"
  },
  {
    "id": 6,
    "name": "Aelfric Eden Oversized Sweater",
    "price":42.34 ,
    "image": "/product/f1.jpeg",
    "images": ["/product/f1.1.jpeg", "/product/f1.2.jpeg"],
    "keyFeature1": "Solid Sweaters for Women：Secured with ribbed detailing at the neck, cuffs, and hem. Knitted sweater, woven pattern, streetwear, vintage, long sleeve tops, casual, crewneck, pullover, oversized, unisex, suitable for young fashion men and women",
    "keyFeature2": "Affordable",
    "keyFeature3": "High-quality Material：This knit woven sweater made of Acrylic, some stretch. Soft and comfortable to wear.",
    "category": "Fashion & Apparel"
  },
  {
    "id": 7,
    "name": "Sunglasses-women Polarized",
    "price":19.99,
    "image": "/product/f2.jpeg",
    "images": ["/product/f2.2.jpeg", "/product/f2.1.jpeg"],
    "keyFeature1": "Polarized UV400 protection: Our sunglasses womens feature high-quality polarized lenses. Lenses can effectively reduce glare and enhance contrast, giving you a clear and comfortable visual experience. Our womens sunglasses also block harmful UV400 rays, protecting your eyes from harmful light. Whether you're driving, traveling, or enjoying a sunny day, our polarized sunglasses women will give you unparalleled vision",
    "keyFeature2": "High Quality Materials: Our women's sunglasses are made of lightweight and durable materials. Women sunglasses include sturdy frames and scratch-resistant lenses that perfectly adapt to all your outdoor experiences. The sunglasses womens trendy are designed to be lightweight and comfortable, so polarized sunglasses men can be worn all day without feeling pressure, and are committed to providing consumers with a comfortable designer sunglasses womens experience",
    "keyFeature3": "Classic Square Design: Our sunglasses for women are the perfect blend of style and function. The classic square design of the square sunglasses for women will make you look great whether you wear it with any outfit or adapt to any occasion. ",
    "category": "Fashion & Apparel"
  },
  {
    "id": 8,
    "name": "Yoga Hat for Women Men",
    "price": 25.99,
    "image": "/product/f3.jpeg",
    "images": ["/product/f3.1.jpeg", "/product/f3.2.jpeg"],
    "keyFeature1": "Yoga Hat:One Size",
    "keyFeature2": "Our Yoga caps are suitable for any age and gender.",
    "keyFeature3": "Our Yoga Hat hats are the ideal gift for any fashion enthusiast.",
    "category": "Fashion & Apparel"
  },
  {
    "id": 9,
    "name": "Beanie Hat Scarf Gloves Headband Set",
    "price": 39.99,
    "image": "/product/f4.jpeg",
    "images": ["/product/f4.1.jpeg", "/product/f4.2.jpeg"],
    "keyFeature1": "Fabric type42%Acrylic32%Nylon26%PBT",
    "keyFeature2": "Care instructionsMachine wash cold, tumble dry low, do not iron, bleach.",
    "keyFeature3": "【Warm 4-Piece Set, Ideal Gift】: SENPUKI Women's Winter Hat, Gloves, Scarf and Headband Set are crafted from a top-grade blend of Acrylic, Nylon, and PBT, ensuring remarkable elasticity, comfort, and warmth. It's a versatile set, perfect for outdoor activities like skiing, running, and camping, and it makes a thoughtful and excellent gift for mom, wife, friends and loved ones for Christmas, Thanksgiving Day and New Year",
    "category": "Fashion & Apparel"
  },
  {
    "id": 10,
    "name": "Mens Muscle T Shirts V Neck",
    "price": 18.99,
    "image": "/product/f5.jpeg",
    "images": ["/product/f5.1.jpeg", "/product/f5.2.jpeg"],
    "keyFeature1": "Comfortable Material: Made of premium polyester cotton blend ribbed fabric, our men’s V neck T-Shirts are soft, stretchy, comfortable, lightweight, and breathable, ensuring lasting comfort and durability.",
    "keyFeature2": "Slim Fit Design: Our men's muscle fit henley shirts designed to fit snugly against your body, shows off your muscle and creates a sleek athletic silhouette that's perfect for any occasion, from gym ocassions to casual outings.",
    "keyFeature3": "Versatile for Any Occasion: Our muscle t-shirts are perfect for workout, fitness, running, cycling, hiking, gym, athletic, and everyday wear. Pair with chinos or jeans for a casual look, or dress them up for a night out.",
    "category": "Fashion & Apparel"
  },
  {
    "id": 11,
    "name": "Under Eye Patches - 60 Pcs",
    "price": 6.55,
    "image": "/product/b1.jpeg",
    "images": ["/product/b1.1.jpeg", "/product/b1.2.jpeg"],
    "keyFeature1": "【Puffy Eyes And Dark Circles Treatment】: Our castor oil under eye patches are highly effective eye skin care treatment which will quickly work against skin aging, smooth wrinkles & fine lines, eliminate dark circles, remove puffiness and speed up cell and collagen Rejuvenation. These under eye patches for dark circles and puffiness make a great beauty gifts for women. Our under eye patches for puffy eyes are truly worth having",
    "keyFeature2": "【Hydrating & Moisturizing】: Hyaluronic acid and castor oil in these under eye pads helps to hydrate and moisturize your skin，providing long-lasting effect,you will notice your skin refreshed and hydrated from the very first application.Reveal a younger-looking you. Our under eye patches for wrinkles and fine lines is a great anti-aging product",
    "keyFeature3": "【Safe & Effective Formula】: Infused with a blend of collagen,castor oil, 24k gold, glycerin and multiple forms of hyaluronic acid which can quickly penetrate into the basal layer, deeply repair the eye skin and promote blood circulation,100% safe without any side effects. Our eye masks for dark circles and puffiness are formulated to be gentle yet effective on all skin types",
    "category": "Beauty & Personal Care"
  },
  {
    "id": 12,
    "name": "Pimple Patches for Face, Hydrocolloid Acne Patches",
    "price": 9.99,
    "image": "/product/b2.jpeg",
    "images": ["/product/b2.1.jpeg", "/product/b2.2.jpeg"],
    "keyFeature1": "【Various Colors and Sizes】: QUSTERE acne patches come in a big pack of 200 pcs, including 5 colors: pink, yellow, blue, green, and transparent, 3 sizes: S-10mm(50pcs), M-12mm(100pcs), and L-14mm(include 50pcs). Cute star pimple patches help to absorb secretions while covering up acne. The hydrocolloid acne patches through clinically tested by our researcher, improve the look of pimples overnight without the popping. Just stick it on, absorb zit liquid and shrinks spots, more clearer-looking skin.",
    "keyFeature2": "【Natural Ingredients】: Star pimple patches for face use with natural ingredients, which include tea tree oil(calming, soothing, and pore-tightening), salicylic acid(penetrating pores and helping to clear up skin), Centella(Prevents excess oiliness that leads to acne), and hydrocolloid(Promote clear-looking skin). These acne patches are ideal for absorbing gunk from acne, whiteheads. Our blotch-covered stickers will shrink your zit overnight! Speed up the acne elimination process.",
    "keyFeature3": "All Skin Type",
    "category": "Beauty & Personal Care"
  },
  {
    "id": 13,
    "name": "Gift Basket for Women - 10 Pc Almond Milk & Honey Beauty & Personal Care Set",
    "price": 38.99,
    "image": "/product/b3.jpeg",
    "images": ["/product/b3.1.jpeg", "/product/b3.2.jpeg"],
    "keyFeature1": "DELUXE 10 PIECE SET - Our deluxe self-care package is filled with all the body soothing spa essentials a woman needs! Shower Gel, Bubble Bath, Body Scrub, Bath Salt, Bath Oil, Hand Towel, 2 x Ex-Large Bath Bombs and Shower Steamer Tablet. Packed in a stunningly wrapped in a handmade basket, it also has a gift note card for you to personalize it.",
    "keyFeature2": "SKIN SOOTHING ALMOND OIL - This premium beauty & personal care package is infused with Almond Oil and Honey for an invigorating experience that is also one of the best things you can do for your skin! Rich in Vitamin E and Shea Butter to protect and keep skin moisturized.",
    "keyFeature3": "Affordable",
    "category": "Beauty & Personal Care"
  },
  {
    "id": 14,
    "name": "Teeth Whitening Kit Gel Pen Strips",
    "price": 25.99,
    "image": "/product/b4.jpeg",
    "images": ["/product/b4.1.jpeg", "/product/b4.2.jpeg"],
    "keyFeature1": "Powerful Tooth Gem Kit with led light for teeth help to stains from coffee, smoking, wine, soda, and food, achieve 8 shades whiter teeth in just one week get your dazzling smile at home personal care",
    "keyFeature2": "More Precise and Comfortable compared with teething cleaning gel strips tools, tooth whitening pen with soft brusher works better on nooks of your teeth braces cleaner kit, compact design is portable for you to use at home, in office, while traveling, anytime and anywhere, painless and effective, is an essential beauty product in life",
    "keyFeature3": "30Mins Fast Teeth Whitening 32X Blue&Red Dual LED-activated whitening technology accelerates your tooth whitening. while the teeth whitener RED lights reduce the tooth sensitive during the lightening treatment",
    "category": "Beauty & Personal Care"
  },
  {
    "id": 15,
    "name": "BIODANCE Bio-Collagen Real Deep Mask",
    "price": 19.00,
    "image": "/product/b5.jpeg",
    "images": ["/product/b5.1.jpeg", "/product/b5.2.jpeg"],
    "keyFeature1": "DEEP HYDRATION: The oligo-hyaluronic acid in the Biodance Bio-Collagen Real Deep Mask provides superior moisturizing effects compared to regular hyaluronic acid. It quickly hydrates the skin's surface and penetrates deeper layers, leaving the complexion healthy and well-moisturized.",
    "keyFeature2": "PORE TIGHTENING & FIRMING: Ultra-low molecular collagen maximizes absorption and skin penetration. It helps refine enlarged pores, enhances skin elasticity immediately after application, and visibly reduces the appearance of fine lines and wrinkles.",
    "keyFeature3": "BRIGHTENS THE SKIN: Formulated with Galactomyces Ferment Filtrate and Niacinamide, it improves uneven skin tone and texture while offering antioxidant effects, resulting in healthier, more radiant skin.",
    "category": "Beauty & Personal Care"
  },
  {
    "id": 16,
    "name": "Lintriguingly DIY Journal Kit for Girls",
    "price": 17.99,
    "image": "/product/s1.jpeg",
    "images": ["/product/s1.1.jpeg", "/product/s1.2.jpeg"],
    "keyFeature1": "1. Unleash Creativity with DIY Fun This DIY journal kit for girls ages 8-14 inspires creativity through scrapbooking, journaling, and art. From stickers to colorful pens, it’s perfect for turning thoughts and memories into a personalized masterpiece.",
    "keyFeature2": "2. The Ultimate Gift for Tweens & Teens Looking for the perfect birthday or Christmas gift for 8-14-year-old girls? This all-in-one set provides hours of creative fun, making it an ideal present for young dreamers and budding artists.",
    "keyFeature3": "3. Build Confidence Through Self-Expression This journaling kit encourages girls to express their thoughts, dreams, and emotions. With diary and scrapbook supplies, it boosts imagination, confidence, and storytelling skills.",
    "category": "Books & Stationery"
  },
  {
    "id": 17,
    "name": "Bibliophile Notes: 20 Different Notecards & Envelopes ",
    "price": 14.31,
    "image": "/product/s2.jpeg",
    "images": ["/product/s2.1.jpeg", "/product/s2.2.jpeg"],
    "keyFeature1": "PERFECT FOR LITERARY LOVERS: This colorfully illustrated notecard set features 20 different book stacks.",
    "keyFeature2": "BOOKISH CHARM: With themes ranging from beloved novels to essential cookbooks, these cards are a great pick for booklovers of all tastes.",
    "keyFeature3": "AWARD-WINNING ILLUSTRATOR: Jane Mount is an award-winning illustrator and designer. Her work has been featured by The New Yorker, The Paris Review, BuzzFeed, and InStyle, among others.",
    "category": "Books & Stationery"
  },
  {
    "id": 18,
    "name": "33 Pieces Vintage Paper and Envelopes Set, Including 12 Writing Stationery Paper Letter ",
    "price": 24.99,
    "image": "/product/s3.jpeg",
    "images": ["/product/s3.1.jpeg", "/product/s3.2.jpeg"],
    "keyFeature1": "Combination of retro patterns and colors: our letter wax seal kit includes 12 pieces of A4 vintage letter paper, 12 pieces of retro envelopes (different retro nostalgic styles), 1 piece of candle spoon, 1 piece of candle seal, 1 piece of tea wax and 6 pieces of tape wax seal with wick; A large number of wax letter stamp kits can meet your various needs for writing letters, letter stamps and envelope stamps",
    "keyFeature2": "Product information: the length of the wax seal key is about 12 cm/ 4.8 inches, which is made of stainless steel and red sandalwood, strong; Its wooden handle allows you to hold it correctly so as not to hurt your hands due to high temperature; The length of the wax seal stamp is 9 cm/ 3.54 inch, made of copper head and wooden handle, which can prevent others from opening important files and protect your private information",
    "keyFeature3": "Multiple colors of wax seals: these wax seals are provide in 6 colors, beautiful and have retro luster, you can choose the appropriate color to match the retro envelope set; Provide you with a variety of bright colors for your choice, applied to decorate envelopes, parcels, invitations, postcards, greeting cards",
    "category": "Books & Stationery"
  },
  {
    "id": 19,
    "name": "Leather Journal Writing Notebook - Genuine Leather Bound Daily Notepad for Men & Women",
    "price": 24.99,
    "image": "/product/s4.jpeg",
    "images": ["/product/s4.1.jpeg", "/product/s4.2.jpeg"],
    "keyFeature1": "GENUINE LEATHER CRAFTSMANSHIP – Crafted with genuine leather, this leather journal offers a soft touch exterior with natural, distressed look that’s truly exclusive",
    "keyFeature2": "MULTIPURPOSE JOURNAL & PLANNER – This versatile men’s and women’s journal can be used as an appointment book, daily journal, sketchbook, or travel diary",
    "keyFeature3": "PREMIUM QUALITY PAPER – Every leather journal notebook is filled with 120 sheets of 100gsm weight, 6.5 mm ruled, 2-sided kraft paper that fits most pens (Refill Paper: B0CNK6FPCF))",
    "category": "Books & Stationery"
  },
  {
    "id": 20,
    "name": "Knaid Vintage Scrapbook Supplies Pack (200 Pieces) ",
    "price": 8.99 ,
    "image": "/product/s5.jpeg",
    "images": ["/product/s5.1.jpeg", "/product/s5.2.jpeg"],
    "keyFeature1": "VALUE SET - Each package comes with approximately 200 pieces of assorted paper & sticker ephemera kit, including 120 pieces of matte writing paper (opaque) and 80 pieces of translucent washi stickers. A large collection of all kinds of vintage style junk journal goodies!",
    "keyFeature2": "HIGH QUALITY PAPER & STICKER - Printed on high-quality paper with matte finishing, these approximately 200 piece paper & sticker pack with mixed sizes and designs are easy to peel off, handwriting friendly and printer friendly.",
    "keyFeature3": "NATURE THEMED JUNK JOURNAL EPHEMERA KIT - There are approximately 200 pieces of assorted paper & stickers with a variety of botanical and nature designs, including butterfly, fern, mushrooms, flowers, plants, trees, old newspaper articles and more. Perfect for junk journals, scrapbooking, collages, or nature-themed art projects!",
    "category": "Books & Stationery"
  },
  {
    "id": 21,
    "name": "Magnetic Chess Game with Stones, Magnet Game, Puzzle Strategy Family Games",
    "price": 9.99,
    "image": "/product/t1.jpeg",
    "images": ["/product/t1.1.jpeg", "/product/t1.2.jpeg"],
    "keyFeature1": "【Strategic and Stress-Relieving Gameplay】: This magnetic chess game is not only a strategic challenge but also serves as a stress-relieving tool. The magnetic stones are satisfying to play with and can be used as fidget toys to help calm nerves and ease anxiety. It's perfect for kids, adults, and anyone looking for a relaxing yet engaging way to pass the time.",
    "keyFeature2": "【Special Needs】: This game is especially beneficial for individuals with autism, ADHD, ADD, and OCD, providing a calming, interactive experience that promotes focus and social interaction. The simple rules and tactile magnetic pieces also make it an excellent tool for improving fine motor skills and encouraging turn-taking. Plus, the magnets offer an enjoyable fidgeting experience to relieve stress.",
    "keyFeature3": "【Family Bonding Activity】: A fantastic activity for family gatherings, this magnetic chess set encourages fun and connection between family members of all ages. Whether you're planning a cozy night in or celebrating the holidays, it's a great way to spend quality time together while fostering meaningful memories",
    "category": "Toys & Games"
  },
  {
    "id": 22,
    "name": "Laser Tag Set of 2, Lazer Tag Game for Kids Indoor & Outdoor Play",
    "price": 27.19,
    "image": "/product/t2.jpeg",
    "images": ["/product/t2.1.jpeg", "/product/t2.2.jpeg"],
    "keyFeature1": "Cyberpunk Design: Our laser tag gun with vest features a stunning cyberpunk-inspired design that is sure to turn heads and immerse players in an exciting sci-fi gaming experience.",
    "keyFeature2": "Life Indicator Show on Gun & Vest: Laser Tag Gun Set includes 2 guns and 2 vests. 2 teams can fight with a LED display to see the lives and team data. There are two Way for Gameplay,Gun VS Gun Battle & Gun Vest Battle.Gun and Vest all can choose team clolor,and the team color determined by vest.4 teams to choose from. You can choose favorite mode for fierce and exciting battles.",
    "keyFeature3": "Synced Gun and Vest for Ultimate Gaming Experience: The gun and vest are synced, allowing players to accurately track their health and ammo levels on both the gun and vest. This ensures a seamless and immersive gaming experience with realistic feedback during gameplay.",
    "category": "Toys & Games"
  },
    {
      "id": 23,
      "name": "Military Blaster Toys Playset Soft Foam Rockets Missile Shooting Game for Kids ",
      "price": 43.99,
      "image": "/product/t3.jpeg",
      "images": ["/product/t3.1.jpeg", "/product/t3.2.jpeg"],
      "keyFeature1": "【ABSOLUTE SECURITY】The mortar launcher toy set is not a model, and the missile with a three-color flash, can be launched without harming anyone or anything. The item made of plastic and sponge. Superior material, durable to use.",
      "keyFeature2": "【THEORETICAL RANGE】Considering the safety of the children, we designed a range of about 16FT/5M. In theory, it has a maximum range of 16FT/5M. During actual play, there may be different ranges due to the angle of the shelf adjustment. And the missiles do not harm children or pets.",
      "keyFeature3": "【MAIN ACCESSORIES】The main accessories are a barrel, a pan and three safety LED colored light foam rocket shells. Included 12 LR44 button batteries (The three missiles each contain three button cells).",
      "category": "Toys & Games"
    },
    {
      "id": 24,
      "name": "Hasbro Gaming Jenga Classic Game with Genuine Hardwood Blocks",
      "price": 12.99,
      "image": "/product/t4.jpeg",
      "images": ["/product/t4.1.jpeg", "/product/t4.2.jpeg"],
      "keyFeature1": "Pull out a block without crashing the stack to win at Jenga",
      "keyFeature2": "Includes 54 Jenga hardwood blocks, stacking sleeve with instructions",
      "keyFeature3": "Simple, solid, and timeless. Each block is three times as long as its width, and one fifth as thick as its length 1.5×2.5×7.5 cm (0.59 in×0.98 in×3.0 in)",
      "category": "Toys & Games"
    },
    {
      "id": 25,
      "name": "60 PCS Magnetic Building Tiles Kids Toys STEM Magnetic Blocks ",
      "price": 25.99,
      "image": "/product/t5.jpeg",
      "images": ["/product/t5.jpeg", "/product/t5.jpeg"],
      "keyFeature1": " Newly upgraded 3D blocks of Coodoo tiles encourage and stimulate kids' creativity. The set contains 60 pcs rainbow bricks in various shapes, Unique the 6 balconies & 2 awning pieces that fit over the hollow square tiles, perfect for building castles, mansions, food trucks, or wherever else the imagination leads. A fun new option in the world of tile play!",
      "keyFeature2": "Magnetic building toys are crafted with premium-grade plastic for durability and resilience, allowing kids to engage in hours of uninterrupted play and building. Plus, the set comes with a convenient storage bag for easy organization and transportation, whether it's taking the tiles outdoors or to a different room.",
      "keyFeature3": "Coodoo magnetic tiles come in a variety of colors and shapes, making them a fun and engaging STEM toy for kids. Building with magnetic tiles not only helps with hand-eye coordination but also enhances cognitive and sensory development, allowing kids to unleash their inner architects and create unique structures.",
      "category": "Toys & Games"
    },
    {
      "id": 26,
      "name": "GoSports Slammo Game Set (Includes 3 Balls, Carrying Case and Rules) ",
      "price": 34.99,
      "image": "/product/o1.jpeg",
      "images": ["/product/o1.1.jpeg", "/product/o1.2.jpeg"],
      "keyFeature1": "WHAT IS SLAMMO: Slammo is an action-packed 2-on-2 volleyball style game where teams have 3 hits to return or spike the ball to the circular net; Fun for the whole family at the beach, BBQs, camping, and in the backyard",
      "keyFeature2": "COMPLETE SET: Includes 1 Slammo roundnet target, 1 large 12 cm training ball to learn the game, 2 smaller 9 cm competition balls, travel carrying case and game rules",
      "keyFeature3": "EASY TO LEARN FOR KIDS & ADULTS: Slammo is the must-have outdoor lawn and beach game for the summer that will engage players of all ages; Retail packaged, makes a great gift",
      "category": "Sports & Outdoors"
    },
    {
      "id": 27,
      "name": "Outdoor Products Mountain Duffel",
      "price": 25.99,
      "image": "/product/o2.jpeg",
      "images": ["/product/o2.1.jpeg", "/product/o2.2.jpeg"],
      "keyFeature1": "Multipurpose large-sized duffel great for hauling gear to the gym and team sports events or packing for travel and camping adventures",
      "keyFeature2": "Spacious main compartment with U-shaped, dual-zippered opening for easy loading; two outside pockets for storing shoes, toiletries, and more",
      "keyFeature3": "Versatile carry options include removable, adjustable shoulder strap, haul handles on the top, and a handle on each end",
      "category": "Sports & Outdoors"
    },
    {
      "id": 28,
      "name": "GOOX Outdoor Beach Ball Games with Carrying Bag, 3 Balls, Net and Strip Light",
      "price": 39.99,
      "image": "/product/o3.jpeg",
      "images": ["/product/o3.1.jpeg", "/product/o3.2.jpeg"],
      "keyFeature1": "【WHAT IS THIS SET】 The yard game is typically a four-person game(2 on 2) with rules kind of like volleyball. But there are still many other ways to play, you can try it if you want.",
      "keyFeature2": "【EASY AND FAST TO ASSEMBLE】 You just need open this outdoor games net and connect it to hooks on the frame in turn so you can start playing immediately. Hooks on the rim are to support the elasticity of the net, you can hook a few less or more to adjust the tightness of the net.",
      "keyFeature3": "【STURDY AND PORTABLE SET】 Built-in sturdy legs made of PP material, sturdy frame made of ABS material, super bounce net, and elastic balls. This yard games set equipped with an air pump and a carry case, easy to store and easy to transport. You can break a sweat anywhere.",
      "category": "Sports & Outdoors"
    },
    {
      "id": 29,
      "name": "GlowCity Glow in The Dark Basketball for Teen Boy - Glowing Red Basket Ball",
      "price": 31.99,
      "image": "/product/o4.jpeg",
      "images": ["/product/o4.1.jpeg", "/product/o4.2.jpeg"],
      "keyFeature1": "30 HOURS OF GLOW - Perfect for kids, teens and the whole family! This size 7 (29.5)LED basketball features 2 lights that are good for up to 30 hours of nighttime play.",
      "keyFeature2": "IMPACT ACTIVATED - Ready to glow up the night? Our bright red basketball illuminates from the inside with a bounce and automatically shuts off when not in use.",
      "keyFeature3": "THICK SKINNED - Each glowing basketball has a sturdy, water-resistant rubber exterior to help keep the lights safeguarded for indoor and outdoor games.",
      "category": "Sports & Outdoors"
    },
    {
      "id": 30,
      "name": "AOKESI Mini Basketball Hoop Indoor with Scorer and Batteries",
      "price": 39.99,
      "image": "/product/o5.jpeg",
      "images": ["/product/o5.1.jpeg", "/product/o5.2.jpeg"],
      "keyFeature1": "【INDOOR BASKETBALL HOOP WITH COLORFUL LED LIGH】Our mini bsketball hoop comes with a audio scorer(3 AAA batteries included), score will be digitally calculated and automatically displayed. Along with the cool and shining colorful lights, the voice system will encourage or cheer for the athletes during the shooting(the sound can be turn off).",
      "keyFeature2": "The mini hoop is made of a high quality polycarbonate,which is shatter resistant and robust. The basket hooks are made of solid alloy metal to support long-term use. The backboard board comes with protective foam paddingand will maximize protection from scratching on mounted surfaces, and most effective in reducing noise.",
      "keyFeature3": "【EASY TO INSTALL AND STORAGE】The toy basketball set includes detailed installation manual and all the necessary tools, making it easy to assemble and start a basketball game in just 10 minutes. The basket adopts a folding design, which saves storage space and does not affect the opening and closing of the door. Portable, you can move it easily hang it on any common size door.",
      "category": "Sports & Outdoors"
    } 
]